src/cf/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
					<Comment>Расчетная ставка НДС 18/118</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
					<Comment>Расчетная ставка НДС 10/110</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
					<Comment>Расчетная ставка НДС 20/120</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС5</Name>
					<Comment>Ставка НДС 5%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС5_105</Name>
					<Comment>Расчетная ставка НДС 5/105</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7</Name>
					<Comment>Ставка НДС 7%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7_107</Name>
					<Comment>Расчетная ставка НДС 7/107</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС22</Name>
					<Comment>Ставка НДС 22%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС22_122</Name>
					<Comment>Расчетная ставка НДС 22/122</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыСтавокНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыСтавокНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Общая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщаяРасчетная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пониженная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПониженнаяРасчетная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нулевая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пониженная2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПониженнаяРасчетная2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщаяУСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПониженнаяУСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщаяУСНРасчетная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПониженнаяУСНРасчетная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/УчетНДСКлиентСервер/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции формирования отчетности по НДС.
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

// Рассчитывает сумму НДС исходя из суммы и флагов налогообложения.
//
// Параметры:
//  Сумма            - Число - сумма от которой надо рассчитывать налоги;
//  СуммаВключаетНДС - Булево - признак включения НДС в сумму ("внутри" или "сверху");
//  СтавкаНДС        - Число - процентная ставка НДС.
//
// Возвращаемое значение:
//  Число - полученная сумма НДС.
//
Функция РассчитатьСуммуНДС(Сумма, СуммаВключаетНДС, СтавкаНДС) Экспорт

	Если СуммаВключаетНДС Тогда
		СуммаБезНДС = 100 * Сумма / (100 + СтавкаНДС);
		СуммаНДС = Сумма - СуммаБезНДС;
	Иначе
		СуммаБезНДС = Сумма;
	КонецЕсли;

	Если НЕ СуммаВключаетНДС Тогда
		СуммаНДС = СуммаБезНДС * СтавкаНДС / 100;
	КонецЕсли;
	
	Возврат СуммаНДС;

КонецФункции // РассчитатьСуммуНДС()

// Производит пересчет цен при изменении флагов учета налогов.
// Пересчет зависит от способа заполнения цен, при заполнении По ценам номенклатуры (при продаже) 
// хочется избегать ситуаций, когда компания  «теряет деньги» при пересчете налогов. 
// Поэтому если в документе флаг "Учитывать налог" выключен, то цены должны браться напрямую из справочника, 
// потому что хочется продавать по той же цене, независимо от режима налогообложения. 
// Например, если отпускная цена задана с НП для избежания ошибок округления, то это не значит, 
// что при отпуске без НП мы должны продать дешевле. Если же флаг учета налога в документе включен, 
// то цены должны пересчитываться при подстановке в документ: 
// налог должен включаться или не включаться в зависимости от флага включения налога в типе цен.
// При заполнении по ценам контрагентов (при покупке) хочется хранить цены поставщиков. 
// Поэтому нужно пересчитывать всегда по установленным флагам в документе и в типе цен. 
// Это гарантирует, что при записи цен в регистр и последующем их чтении, 
// например, при заполнении следующего документа, мы с точностью до ошибок округления при пересчете 
// получим те же самые цены.
//
// Параметры: 
//  Цена                - Число - Пересчитываемое значение цены.
//  ЦенаВключаетНДС     - Булево - Определяет содержит ли переданное значение цены НДС.
//  СуммаВключаетНДС    - Булево - Определяет должно ли новое значение цены включать НДС.
//  СтавкаНДС           - Число - Ставка НДС.
//
// Возвращаемое значение:
//  Число - Новое значение цены.
//
Функция ПересчитатьЦенуПриИзмененииФлаговНалогов(Цена, ЦенаВключаетНДС,
						СуммаВключаетНДС, СтавкаНДС) Экспорт

	// Инициализация переменных
	НадоВключитьНДС  = Ложь;
	НадоИсключитьНДС = Ложь;
	НоваяЦена		 = Цена;

	Если СуммаВключаетНДС
		И (НЕ ЦенаВключаетНДС) Тогда
		
		// Надо добавлять НДС       
		НадоВключитьНДС = Истина;
	ИначеЕсли (НЕ СуммаВключаетНДС)
		И ЦенаВключаетНДС  Тогда
		
		// Надо исключать НДС       
		НадоИсключитьНДС = Истина;
	КонецЕсли;
		
	Если НадоИсключитьНДС Тогда
		НоваяЦена = (НоваяЦена * 100) / (100 + СтавкаНДС);
	КонецЕсли;

	Если НадоВключитьНДС Тогда
		НоваяЦена = (НоваяЦена * (100 + СтавкаНДС)) / 100;
	КонецЕсли;

	Возврат НоваяЦена;

КонецФункции // ПересчитатьЦенуПриИзмененииФлаговНалогов()

// Возвращает номер версии подсистемы НДС.
//
// Параметры:
//  Дата - Дата - Проверяемая дата.
//
// Возвращаемое значение:
//  Число - номер версии.
//
Функция Версия(Дата) Экспорт
	
	Возврат 2;
	
КонецФункции

// Определяет версию перечня кодов видов операций для отчетности по НДС на переданную дату.
//
// Параметры:
//   Период - Дата - дата, на которую требуется определить версию перечня видов операций.
// Возвращаемое значение:
//  Число - номер версии кодов видов операций:
//          1 - перечень, утвержденный приказом ФНС 14.02.2012 N ММВ-7-3/83@;
//          2 - перечень, утвержденный письмом ФНС от 22.01.2015 N ГД-4-3/794@;
//          3 - перечень, утвержденный приказом ФНС от 14.03.2016 N ММВ-7-3/136@.
Функция ВерсияКодовВидовОпераций(Период) Экспорт
	
	Если Период >= '20240401' Тогда
		// С 1 апреля 2024 года используется дополнительный код, рекомендованный в письме ФНС от 06.06.2024 № ЕА-4-3/6295@).
		Возврат 5;
	ИначеЕсли Период >= '20180101' Тогда
		// С 1 января 2018 года используются дополнительные коды, рекомендованные в письмах ФНС:
		// N СД-4-3/10@ от 09.01.2018;
		// N СД-4-3/532@ от 16.01.2018;
		// N СД-4-3/480@ от 16.01.2018.
		Возврат 4;
	ИначеЕсли Период >= '20160701' Тогда
		// С 1 июля 2016 года действует перечень, 
		// утвержденный приказом ФНС от 14.03.2016 N ММВ-7-3/136@.
		Возврат 3;
	ИначеЕсли Период >= '20150101' Тогда
		// С 1 января 2015 года действует перечень,
		// утвержденный письмом ФНС от 22.01.2015 N ГД-4-3/794@.
		Возврат 2;
	Иначе
		// До 1 января 2015 года действует перечень,
		// утвержденный приказом ФНС 14.02.2012 N ММВ-7-3/83@.
		Возврат 1;
	КонецЕсли;
	
КонецФункции

// Документы по учету НДС для передачи в электронном виде

// Возвращает код периода для передачи книг и журналов по НДС в электронном виде
//
// Параметры:
//	Период - Дата - Дата налогового периода.
//	Реорганизация - Булево - Признак реорганизации.
//
// Возвращаемое значение:
//	Строка - Строковый код налогового периода.
//
Функция ПолучитьКодПоСКНП(Период, Реорганизация = Ложь) Экспорт 
	
	Мес = Цел((Месяц(Период) - 1)/3);
	
	Если Реорганизация Тогда
		Если Мес = 0 Тогда
			Возврат "51";
		ИначеЕсли Мес = 1 Тогда 
			Возврат "54";
		ИначеЕсли Мес = 2 Тогда 
			Возврат "55";
		ИначеЕсли Мес = 3 Тогда 
			Возврат "56";
		КонецЕсли;
	Иначе
		Если Мес = 0 Тогда
			Возврат "21";
		ИначеЕсли Мес = 1 Тогда 
			Возврат "22";
		ИначеЕсли Мес = 2 Тогда 
			Возврат "23";
		ИначеЕсли Мес = 3 Тогда 
			Возврат "24";
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Проверяет, что код вида операции соответствует формату.
//
// Параметры:
//  КодВидаОперации - Строка - Строка с кодами вида операции, разделенными символом ";".
//
// Возвращаемое значение:
//  Булево - Истина, если код вида операции соответствует формату, иначе Ложь.
//
Функция ФорматныйКонтрольКодаВидаОперацииПройден(КодВидаОперации) Экспорт
    
    Результат = Истина;
    
    КодыВидовОперации = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(КодВидаОперации, ";");
    Для Каждого Код Из КодыВидовОперации Цикл
        Если Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Код) Тогда
            Результат = Ложь;
        КонецЕсли;
        Если СтрДлина(Код) > 2 Тогда
            Результат = Ложь;
        КонецЕсли;
    КонецЦикла;
    
    Возврат Результат;
    
КонецФункции

// Возвращает пояснение к ошибке в номере декларации.
//
// Параметры:
//  КодОшибки - Число - Код ошибки.
//  ЭтоЭкспорт - Булево - Признак экспортной декларации.
//  НомерТаможеннойДекларации - Строка - Номер таможенной декларации.
//  НачалоКорректногоПериода - Дата - Начало периода, в котором номер декларации считается корректным.
//  КонецКорректногоПериода - Дата - Конец периода, в котором номер декларации считается корректным.
//
// Возвращаемое значение:
//  Строка - Пояснение к ошибке.
//
Функция НаличиеОшибокВНомереДекларации(НомерТаможеннойДекларации, НачалоКорректногоПериода, КонецКорректногоПериода, ЭтоРНПТ = Ложь) Экспорт
	
	НомерДекларацииНаТовары = СокрЛП(НомерТаможеннойДекларации);
	
	Если НЕ ЗначениеЗаполнено(НомерДекларацииНаТовары) Тогда
		// Пользователь еще ничего не ввел.
		Возврат 0;
	КонецЕсли;
	
	МассивТД = СтрРазделить(НомерДекларацииНаТовары, "/");
	
	Если ЭтоРНПТ Тогда 
		Если МассивТД.Количество() <> 4 Тогда
			// Ошибочное количество элементов.
			Возврат 1;
		КонецЕсли;
	ИначеЕсли МассивТД.Количество() > 4
		ИЛИ МассивТД.Количество() < 3 Тогда
		// Ошибочное количество элементов.
		Возврат 1;
	КонецЕсли;
	
	КодТаможенногоОргана = МассивТД[0];
	
	Если СтрДлина(КодТаможенногоОргана) <> 2
	   И СтрДлина(КодТаможенногоОргана) <> 5
	   И СтрДлина(КодТаможенногоОргана) <> 8 Тогда
		// Ошибочная длина кода таможенного органа.
		Возврат 2;
	КонецЕсли;
	
	ДатаПринятияДекларацииНаТовары = МассивТД[1];
	
	Если СтрДлина(ДатаПринятияДекларацииНаТовары) <> 6 Тогда
		// Ошибочная длина поля дата.
		Возврат 3;
	Иначе
		// Проверим корректность указания даты.
		Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ДатаПринятияДекларацииНаТовары) Тогда
			// Длина поля верная, но дата указана ошибочно.
			Возврат 3;
		КонецЕсли; 
		
		СтрокаВДату = СтроковыеФункцииКлиентСервер.СтрокаВДату(ДатаПринятияДекларацииНаТовары);
		Если НЕ ЗначениеЗаполнено(СтрокаВДату) Тогда
			// Длина поля верная, но дата указана ошибочно.
			Возврат 3;
		Иначе
			// Проверим год на корректность указания.
			
			Если СтрокаВДату < НачалоКорректногоПериода 
			 ИЛИ СтрокаВДату > КонецКорректногоПериода Тогда
				Возврат 4;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	ПорядковыйНомерДекларацииНаТовары = МассивТД[2];
	
	Если СтрДлина(ПорядковыйНомерДекларацииНаТовары) < 7
	 ИЛИ СтрДлина(ПорядковыйНомерДекларацииНаТовары) > 8 Тогда
		// Ошибочная длина поля порядковый номер.
		Возврат 5;
	КонецЕсли;
	
	// В устаревшем формате предварительной таможенной декларации (ориентировочно 2008 год)
	// порядковый номер декларации на товары состоит из 7 символов, первый символ - буква "П",
	// шесть оставшихся - цифры.
	// В случае представления заявления о выпуске товаров до подачи декларации на товары (ориентировочно с 4 августа 2019 года) 
	// регистрационный номер таможенной декларации имеет вид
	//    X......X/XXXXXX/BXXXXXX
	//   ________ ______ ________,
	// 
	//      1      2        3
	//(в ред. решения Коллегии Евразийской экономической комиссии от 02.07.2019 N 108)
	Если СтрДлина(ПорядковыйНомерДекларацииНаТовары) = 7 Тогда
		ПервыйСимвол = ВРег(Лев(ПорядковыйНомерДекларацииНаТовары, 1));
		ПоследниеШестьСимволов = ВРег(Прав(ПорядковыйНомерДекларацииНаТовары, 6));
		УстаревшийНомерТД = ПервыйСимвол = "П" И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ПоследниеШестьСимволов);
		ЗаявлениеОВыпускеТоваров2019 = ПервыйСимвол = "В" И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ПоследниеШестьСимволов);
		Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ПорядковыйНомерДекларацииНаТовары)
		   И НЕ УстаревшийНомерТД
		   И НЕ ЗаявлениеОВыпускеТоваров2019 Тогда
			// Ошибочный формат поля порядковый номер.
			Возврат 5;
		КонецЕсли;
	КонецЕсли;

	// В случае выпуска товаров до подачи таможенной декларации импортер представляет в налоговый орган
	// обязательство о подаче таможенной декларации (до 2018 года) 
	// или заявление о выпуске товаров (с 1 января 2018 года по 4 августа 2019 года).
	// При этом порядковый номер декларации на товары состоит из 8 символов.
	// Порядковый принимает вид "ОБ123456" или "ЗВ123456" соответственно.
	Если СтрДлина(ПорядковыйНомерДекларацииНаТовары) = 8 Тогда
		ПервыеДваСимвола = ВРег(Лев(ПорядковыйНомерДекларацииНаТовары, 2));
		Если ПервыеДваСимвола = "0Б" Тогда 
			// Вместо буквы "О" указана цифра ноль.
			Возврат 6;
		ИначеЕсли ПервыеДваСимвола = "3В"
		      ИЛИ ПервыеДваСимвола = "3B" Тогда
			// Вместо буквы "З" указана цифра три.
			Возврат 7;
		ИначеЕсли ПервыеДваСимвола <> "ОБ"
		        И ПервыеДваСимвола <> "OБ"
		        И ПервыеДваСимвола <> "ЗВ"
		        И ПервыеДваСимвола <> "ЗB" Тогда 
			// Ошибочный формат поля порядковый номер.
			Возврат 5;
		КонецЕсли;
		ПоследниеШестьСимволов = ВРег(Прав(ПорядковыйНомерДекларацииНаТовары, 6));
		Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ПоследниеШестьСимволов) Тогда
			// Ошибочный формат поля порядковый номер.
			Возврат 5;
		КонецЕсли;
	КонецЕсли;
	
	Если МассивТД.Количество() = 4 Тогда
		ПорядковыйНомерТовара = МассивТД[3];
		Если СтрДлина(ПорядковыйНомерТовара) > 3
		 ИЛИ СтрДлина(ПорядковыйНомерТовара) < 1 Тогда
			// Ошибочная длина поля порядковый номер товара.
			Возврат 8;
		КонецЕсли;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

// Возвращает пояснение к ошибке в номере декларации.
//
// Параметры:
//  КодОшибки - Число - Код ошибки.
//  ЭтоЭкспорт - Булево - Признак экспортной декларации.
//  ЭтоРНПТ - Булево - Признак декларации РНПТ.
//
// Возвращаемое значение:
//  Строка - Пояснение к ошибке.
//
Функция ПояснениеКОшибкеВНомереДекларации(КодОшибки, ЭтоЭкспорт = Ложь, ЭтоРНПТ = Ложь) Экспорт

	Если КодОшибки = 1 Тогда
		Если ЭтоЭкспорт Тогда
			Возврат НСтр("ru='Номер должен состоять из трех блоков, разделенных дробью ""/""'");
		ИначеЕсли ЭтоРНПТ Тогда
			Возврат НСтр("ru='Номер должен состоять из четырех блоков, разделенных дробью ""/""'"); 
		Иначе
			Возврат НСтр("ru='Номер должен состоять из трех или четырех блоков, разделенных дробью ""/""'"); 
		КонецЕсли; 
	ИначеЕсли КодОшибки = 2 Тогда
		Если ЭтоЭкспорт Тогда
			Возврат НСтр("ru='Первый блок (код таможенного органа) должен состоять из 8 цифр'");
		Иначе
			Возврат НСтр("ru='Первый блок (код таможенного органа) в зависимости от страны ввоза должен состоять из 2, 5 или 8 цифр'"); 
		КонецЕсли; 
	ИначеЕсли КодОшибки = 3 Тогда
		Возврат НСтр("ru='Второй блок (дата регистрации декларации) должен быть в формате ДДММГГ'"); 
	ИначеЕсли КодОшибки = 4 Тогда
		Возврат НСтр("ru='Во втором блоке (дата регистрации декларации) указанный год лежит за пределами допустимого периода'"); 
	ИначеЕсли КодОшибки = 5 Тогда
		Если ЭтоЭкспорт Тогда
			Возврат НСтр("ru='Третий блок (порядковый номер декларации) должен состоять из 7 цифр'");
		Иначе
			Возврат НСтр("ru='Третий блок (порядковый номер декларации) должен состоять из 7 цифр или из букв (""ОБ"", ""ЗВ"", ""В"" или ""П"") и 6 цифр'");
		КонецЕсли;
	ИначеЕсли КодОшибки = 6 Тогда
		Возврат НСтр("ru='В третьем блоке вместо буквы ""О"" указана цифра ноль'");
	ИначеЕсли КодОшибки = 7 Тогда
		Возврат НСтр("ru='В третьем блоке вместо буквы ""З"" указана цифра три'");
	ИначеЕсли КодОшибки = 8 Тогда
		Возврат НСтр("ru='Четвертый блок (порядковый номер товара) должен содержать от 1 до 3 цифр'");
	КонецЕсли;
	
КонецФункции

// Проверяет, применяется ли Федеральный закон №176-ФЗ на указанную дату.
//
// Параметры:
//  Период - Дата - Дата, на которую необходимо проверить применение закона.
//
// Возвращаемое значение:
//  Булево - Истина, если закон применяется на указанную дату, иначе Ложь.
//
Функция Применяется176ФЗ(Период) Экспорт
	
	Возврат Период >='20250101';
	
КонецФункции

// Возвращает дату, с которой применяется НДС на УСН
//
// Возвращаемое значение:
//  Дата
//
Функция ДатаНачалаПримененияНДС() Экспорт
    
    // Федеральный закон от 12.07.2024 № 176-ФЗ
	Возврат Дата(2025, 1, 1);

КонецФункции

#Область УправлениеФормой

// Отображает текстовое пояснение по корректности выбора периода формирования отчета.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - Форма отчета.
//
Процедура ОтобразитьПоясненияКПериодуОтчета(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	Объект = Форма.Отчет;
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Элементы.ПояснениеРасширенныйНалоговыйПериод.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	БлижайшийНалоговыйПериод = УчетНДСВызовСервера.БлижайшийНалоговыйПериодСервер(
		Объект.Организация,
		Объект.КонецПериода);
	
	УчетВедется = Объект.КонецПериода >= НачалоКвартала(БлижайшийНалоговыйПериод.Начало);
	
	Если БлижайшийНалоговыйПериод.Конец = КонецДня(КонецКвартала(Объект.КонецПериода))
	   И КонецКвартала(БлижайшийНалоговыйПериод.Начало) < КонецКвартала(БлижайшийНалоговыйПериод.Период) Тогда
		
		// Расширенный налоговый период
		
		Элементы.ПояснениеРасширенныйНалоговыйПериод.Видимость = Истина;
		ШаблонСообщения = НСтр("ru='Период с даты регистрации %1 по %2 включается в отчетность по НДС за %3.'");
		ТекстПояснения = СтрШаблон(
			ШаблонСообщения,
			Формат(БлижайшийНалоговыйПериод.Начало, "ДЛФ=D"), 
			Формат(КонецКвартала(БлижайшийНалоговыйПериод.Начало), "ДЛФ=D"),
			Формат(БлижайшийНалоговыйПериод.Конец, "ДФ='к ''квартал'' гггг ''года'''"));
		Элементы.ПояснениеРасширенныйНалоговыйПериод.Заголовок = ТекстПояснения;
		
	ИначеЕсли УчетВедется 
		    И БлижайшийНалоговыйПериод.Конец > КонецДня(КонецКвартала(Объект.КонецПериода)) Тогда
		Элементы.ПояснениеРасширенныйНалоговыйПериод.Видимость = Истина;
		ШаблонСообщения = НСтр("ru='Отчетность по НДС за %1 сдавать не нужно. Период с даты регистрации %2 по %3 включается в отчетность за %4.'");
		ТекстПояснения = СтрШаблон(
			ШаблонСообщения,
			Формат(КонецКвартала(Объект.КонецПериода), "ДФ='к ''квартал'' гггг ''года'''"),
			Формат(БлижайшийНалоговыйПериод.Начало, "ДЛФ=D"), 
			Формат(КонецКвартала(БлижайшийНалоговыйПериод.Начало), "ДЛФ=D"),
			Формат(БлижайшийНалоговыйПериод.Конец, "ДФ='к ''квартал'' гггг ''года'''"));
		Элементы.ПояснениеРасширенныйНалоговыйПериод.Заголовок = ТекстПояснения;
	Иначе
		Элементы.ПояснениеРасширенныйНалоговыйПериод.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

// Вызывается их обработчиков при смене организации в формах отчетов по НДС.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - Форма отчета.
//
Процедура ФормаОтчетаОрганизацияПериодПриИзменении(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	
	ОтобразитьПоясненияКПериодуОтчета(Форма);
	
	Если НЕ ЗначениеЗаполнено(Форма.ИдентификаторЗадания) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция СтавкаНДСПоУмолчанию(Период, ПлательщикНДС = Истина) Экспорт
	
	Если ПлательщикНДС Тогда
		Возврат ОбщаяСтавкаНДС(Период);
	Иначе
		Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
	КонецЕсли;

КонецФункции

// Определяет ставку НДС для подстановки в документы.
//
// Параметры:
//  Период - Дата - Дата, на которую определяется общая ставка НДС.
//  ПлательщикНДС - Булево - По умолчанию Истина, если организация является плательщиком НДС.
//
// Возвращаемое значение:
//  ПеречислениеСсылка.СтавкиНДС - Ставка НДС, которая может быть:
Функция СтавкаНДСПользователя(Период, ПлательщикНДС = Истина) Экспорт
	
	Если ПлательщикНДС Тогда
		СтавкаНДСПользователя = УчетНДСВызовСервера.СтавкаНДСПользователя();
		Возврат ?(ЗначениеЗаполнено(СтавкаНДСПользователя), СтавкаНДСПользователя, СтавкаНДСПоУмолчанию(Период, ПлательщикНДС));
	Иначе
		Возврат СтавкаНДСПоУмолчанию(Период, ПлательщикНДС);
	КонецЕсли;
	
КонецФункции

Функция РасчетнаяСтавкаНДСПоУмолчанию(Период) Экспорт
	
	Возврат ОбщаяРасчетнаяСтавкаНДС(Период);
	
КонецФункции

Функция СтавкаНДСИсчисляетсяНалоговымАгентом(Период, Организация = Неопределено) Экспорт

	Если ЗначениеЗаполнено(Организация) Тогда // ставка НДС определяется по основной ставке Организации
		Возврат УчетНДСВызовСервера.РасчетнаяСтавкаНДСОрганизации(Организация, Период);
	Иначе // ставка не зависит от налогообложения Организации
		Возврат РасчетнаяСтавкаНДСПоУмолчанию(Период);
	КонецЕсли;
	
КонецФункции

Функция ОсновнаяСтавкаНДСПоБилетам(Период, ДополнительныеУслуги = Ложь) Экспорт
	
	// На дополнительные услуги чаще всего обычная ставка НДС
	Если ДополнительныеУслуги Тогда
		Возврат ОбщаяСтавкаНДС(Период);
	КонецЕсли;

	// По ставке 0% облагаются:
	// - внутренние ж/д перевозки
	// - авиа перевозки, пунктом отправления или назначения которых, является республика Крым
	// - международные авиа и ж/д перевозки
	Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
	
КонецФункции

Функция ОбщаяУСНСтавкаНДС(Период) Экспорт
	
	Если Применяется176ФЗ(Период) Тогда
		Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС7");
	Иначе
		Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка");
	КонецЕсли;
	
КонецФункции

Функция РасчетнаяУСНСтавкаНДС(Период) Экспорт
	
	Если Применяется176ФЗ(Период) Тогда
		Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС7_107");
	Иначе
		Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка");
	КонецЕсли;
	
КонецФункции

Функция ПониженнаяУСНСтавкаНДС(Период) Экспорт
	
	Если Применяется176ФЗ(Период) Тогда
		Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС5");
	Иначе
		Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка");
	КонецЕсли;
	
КонецФункции

Функция ПониженнаяРасчетнаяУСНСтавкаНДС(Период) Экспорт
	
	Если Применяется176ФЗ(Период) Тогда
		Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС5_105");
	Иначе
		Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка");
	КонецЕсли;
	
КонецФункции

Функция ТекстовоеПредставлениеСтавкиНДС(ВидСтавки, Период) Экспорт
	
	Если ВидСтавки = ПредопределенноеЗначение("Перечисление.ВидыСтавокНДС.Общая") Тогда
		Возврат СтрШаблон("%1 (%2, %3 при УСН)", 
			ОбщаяСтавкаНДС(Период), ПониженнаяУСНСтавкаНДС(Период), ОбщаяУСНСтавкаНДС(Период));
	ИначеЕсли ВидСтавки = ПредопределенноеЗначение("Перечисление.ВидыСтавокНДС.Пониженная") Тогда
		Возврат СтрШаблон("%1 (%2, %3 при УСН)", 
			ПониженнаяСтавкаНДС(Период), ПониженнаяУСНСтавкаНДС(Период), ОбщаяУСНСтавкаНДС(Период));
	Иначе
		Возврат Строка(УчетНДСВызовСервера.СтавкаНДС(ВидСтавки, Период));
	КонецЕсли;
	
КонецФункции

// С учетом предполагаемых изменений в НК РФ порог применения освобождения от НДС
// может быть изменен. На момент выпуска релиза на этот счет нет точной информации.
Функция ПорогОсвобожденияОтНДС(Период) Экспорт 
	
	Если Период < '20260101' Тогда
		Возврат 60;
	Иначе
		Возврат 60;
	КонецЕсли;
	
КонецФункции

// С учетом предполагаемых изменений в НК РФ коэффициент-дефлятор может быть увеличен.
// На момент выпуска релиза на этот счет нет точной информации.
Функция ПорогПримененияПониженнойСтавкиНДСПриУСН(Период) Экспорт 
	
	Если Период < '20260101' Тогда
		Возврат 250;
	Иначе
		Возврат 250;
	КонецЕсли;
	
КонецФункции

// С учетом предполагаемых изменений в НК РФ коэффициент-дефлятор может быть увеличен.
// На момент выпуска релиза на этот счет нет точной информации.
Функция ПорогПримененияОбщейСтавкиНДСПриУСН(Период) Экспорт
	
	Если Период < '20260101' Тогда
		Возврат 450;
	Иначе
		Возврат 450;
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьСписокВыбораВидовТранспорта(СписокЗначений) Экспорт
	
	// Список взят из макета СпискиВыбора2015Кв4 отчета РегламентированныйОтчетРеестрНДСПриложение5
	// Здесь дублирован сцециально, чтобы не было серверного вызова с клиента
	
	СписокЗначений.Очистить();
	СписокЗначений.Добавить("10", "10 - Морской/речной транспорт");
	СписокЗначений.Добавить("20", "20 - Железнодорожный транспорт");
	СписокЗначений.Добавить("30", "30 - Автодорожный транспорт, за исключением транспортных средств, указанных под кодами 31, 32");
	СписокЗначений.Добавить("31", "31 - Состав транспортных средств (тягач с полуприцепом или прицепом)");
	СписокЗначений.Добавить("32", "32 - Состав транспортных средств (тягач с прицепом (-ами) и полуприцепом (-ами) )");
	СписокЗначений.Добавить("40", "40 - Воздушный транспорт");
	СписокЗначений.Добавить("50", "50 - Почтовое отправление");
	СписокЗначений.Добавить("71", "71 - Трубопроводный транспорт");
	СписокЗначений.Добавить("72", "72 - Линии электропередачи");
	СписокЗначений.Добавить("80", "80 - Внутренний водный транспорт");
	СписокЗначений.Добавить("90", "90 - Транспортное средство, перемещающееся в качестве товара своим ходом");
	СписокЗначений.Добавить("99", "99 - Прочие");
	
КонецПроцедуры

#Область СтавкиНДСВычисляемыеПоОрганизации

// Определяется ставка НДС для подстановки в документы реализации
// Параметры:
//  Организация          - СправочникСсылка.Организации - организация для которой определяется ставка НДС при реализации
//  Период               - Дата - дата на которую определяется ставка НДС при реализации
// Возвращаемое значение:
//   Ставка НДС    - ПеречислениеСсылка.СтавкиНДС - ставка НДС при реализации
Функция СтавкаНДСПриРеализации(Период, Организация) Экспорт
	
	Возврат УчетНДСВызовСервера.СтавкаНДСПоОрганизации(Организация, Период);
	
КонецФункции

// Определяется расчетная ставка НДС для подстановки в счета-фактуры на аванс
// Параметры:
//  Организация          - СправочникСсылка.Организации - организация для которой определяется ставка НДС по авансам
//  Период               - Дата - дата на которую определяется ставка НДС по авансам
// Возвращаемое значение:
//   Ставка НДС    - ПеречислениеСсылка.СтавкиНДС - ставка НДС для аванса
Функция РасчетнаяСтавкаНДСПоАвансам(Организация, Период) Экспорт
	
	СтавкаНДСПользователя = УчетНДСВызовСервера.СтавкаНДСПользователя();
	
	Если ЗначениеЗаполнено(СтавкаНДСПользователя) Тогда
		Возврат УчетНДСВызовСервера.РасчетнаяСтавкаНДСПоОбычной(СтавкаНДСПользователя);
	КонецЕсли;
	
	Возврат УчетНДСВызовСервера.РасчетнаяСтавкаНДСОрганизации(Организация, Период);
	
КонецФункции

#КонецОбласти





#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Область ПодстановкаСтавкиНДС

// Эти функции служат для определения, какая ставка НДС должна быть подставлена в документы
// ОбщаяСтавкаНДС - Общая ставка НДС, актуальная на дату (НДС 18%, 20% или 22%)
// СтавкаНДСПоУмолчанию - это либо ставка Без НДС (если организация не плательщик НДС)
//                      - либо общая ставка НДС, актуальная на дату (если организация плательщик НДС)
// СтавкаНДСПользователя - ставка НДС, которую пользователь заполнил как основную в пользовательских настройках
Функция ОбщаяСтавкаНДС(Период) Экспорт
	
	Если Период < '20190101' Тогда
		Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18");
	ИначеЕсли Период < '20260101' Тогда
		Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20");
	Иначе
		Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22");
	КонецЕсли;
	
КонецФункции

Функция ПониженнаяСтавкаНДС(Период) Экспорт
	
	Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10");
	
КонецФункции

Функция ОбщаяРасчетнаяСтавкаНДС(Период) Экспорт
	
	Если Период < '20190101' Тогда
		Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18_118");
	ИначеЕсли Период < '20260101' Тогда
		Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20_120");
	Иначе
		Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22_122");
	КонецЕсли;
	
КонецФункции


#КонецОбласти
